api/test/fixtures/paymentCreationResponse/mercadopago_cc.json

{ "data": {
        "id": "EXTERNAL_REFERENCE",
        "date_created": "2017-01-06T15:53:06.000-04:00",
        "date_approved": null,
        "date_last_updated": "2017-01-06T15:53:10.000-04:00",
        "money_release_date": null,
        "operation_type": "regular_payment",
        "issuer_id": "10",
        "payment_method_id": "visa",
        "payment_type_id": "credit_card",
        "status": "in_process",
        "status_detail": "pending_contingency",
        "currency_id": "BRL",
        "description": "Nome do Produto de Teste",
        "live_mode": true,
        "sponsor_id": null,
        "authorization_code": 1234,
        "collector_id": 100000000,
        "payer": {
            "type": "guest",
            "id": null,
            "email": "test_user_29505388@testuser.com",
            "identification": {
                "type": "CPF",
                "number": "111111111111"
            },
            "phone": {
                "area_code": "01",
                "number": "1111-1111",
                "extension": ""
            },
            "first_name": "Test",
            "last_name": "Test",
            "entity_type": null
        },
        "metadata": {},
        "additional_info": {
            "items": [
                {
                    "id": "Referencia 121232",
                    "title": "Nome do Produto de Teste",
                    "description": "Nome do Produto de Teste",
                    "picture_url": null,
                    "category_id": "services",
                    "quantity": "1",
                    "unit_price": "900"
                }
            ],
            "payer": {
                "phone": {
                    "number": "2199999999"
                },
                "address": {
                    "zip_code": "12123321",
                    "street_name": "Rua de Teste",
                    "street_number": "12123"
                },
                "first_name": "CONTHolis B."
            },
            "shipments": {
                "receiver_address": {
                    "zip_code": "12123321",
                    "street_name": "Rua de Teste",
                    "street_number": "12123",
                    "apartment": "Teste de complemento"
                }
            }
        },
        "order": {},
        "external_reference": "CPR1483732384",
        "transaction_amount": 900,
        "transaction_amount_refunded": 0,
        "coupon_amount": 0,
        "differential_pricing_id": null,
        "deduction_schema": null,
        "transaction_details": {
            "net_received_amount": 0,
            "total_paid_amount": 900,
            "overpaid_amount": 0,
            "external_resource_url": null,
            "installment_amount": 900,
            "financial_institution": null,
            "payment_method_reference_id": null
        },
        "fee_details": [],
        "captured": true,
        "binary_mode": false,
        "call_for_authorize_id": null,
        "statement_descriptor": "TROCAFONE",
        "installments": 1,
        "card": {
            "id": null,
            "first_six_digits": "423564",
            "last_four_digits": "5682",
            "expiration_month": 2,
            "expiration_year": 2019,
            "date_created": "2017-01-06T15:53:06.000-04:00",
            "date_last_updated": "2017-01-06T15:53:06.000-04:00",
            "cardholder": {
                "name": "CONT",
                "identification": {
                    "number": "66505311971",
                    "type": "CPF"
                }
            }
        },
        "notification_url": null,
        "refunds": []
    }
}
